learn_biomarker_analysis.org
#+title: Learn Biomarker Analysis

* What Is A Biomarker
** FDA Definition
"A defined characteristic that is measured as an indicator of normal biological processes, pathogenic processes, or responses to an exposure of intervention, including therapeutic interventions. Molecular, histologic, radiographic, or physiologic characteristics are types of biomarkers. A biomarker is NOT an assessment of how an individual feels, functions, or survives."

*** Examples
Lab based (LIPIDs), Genetic Biomarker (histologic, blood, fluid, CSF, etc), Radiographic (MRI, PET), composite biomarkers, digital biomarkers.

** Fundamental Pharmacology Questions for Biomarkers
- Drug exposure at target site of action
- Binding to pharmacological target (Engagement/Occupancy)
- Expression of pharmacology (PD effect)

** Evidence Taken Together Integrated Framework for Decision-Making
 - Several PD biomarkers over several phases of clinical development constitute a complete picture of the drug's mechanism in the body from minutes to hours and days of drug administration
   - Vaidating target engagement
   - Selection of optimal dose
   - Identifying potential early efficacy and/or safety
   - Identification of patient subgroup likely to respond from treatment with the drug
   - Help design combination therapies

 - Pfizer has defined three pillars of survival of a drug through clinical development in order to progress to phase III. The drug condidate must demonstrate:
   - Exposure at the target site of action over a desired period of time
   - Binding to the pharmacological target as expected for its mode of action
   - Expression of pharmacological activity commensurate with the demonstrated target exposure and target binding

* Section I: Pharmacodynamic Biomarkers
 -- Ecosystem of Tools Predicting Risk and Progression in AD Trials

** Outline

- Could range from Proof of Mechanism or Proof of Efficacy
- Animal toxicology studies
- Bioequivalence Designs
- Graphical Visualizations of Biomarker over time
- Joint modeling of Biomarker and Efficacy Endpoint
  - Longitudinal model of PD biomarkers by MMRM
  - Time to Event analysis with time-varying biomarker
  - Bivariate model of biomarker and endpoint

** Objectives of PD Biomarkers

The effort of developing assays and measuring one or more biomarkers across several phases of clinical trials help

- Validate target engagement
- Select optimal dose
- Identify early efficacy/safety
- Identify potential subgroup who responds to treatment
- Help design combination therapies
- ...

** Toxicology
- Rodent in-vivo pre-clinical studies
  - Estimate PK parameters or calculate # of animals in various designs
    - Serial, Complete, Betch Design

- Non-compartmental PK analysis through R package "PK"
  - "RATS" data from holder, et al

** Bioequivalence Design
- Corossover equivalence design - tost processedure and composite hypothesis
- Composite Hypothesis based on the ratio \(\mu_{T}/\mu_{R}\):
  - H0: \(H_{0}: \mu_{T}/\mu_{R} \le \theta_{1} or \mu_{T}/\mu_{R} \ge \theta_{2} VS \)
- Schultz, et al shows various examples & compares R, SAS and Winnonlin
- R package "powertost" provides power calculations for two one-sided tests
- R package "BE":
  - Analysis of BE study 2x2x2
  - MSE calculations; CV (coefficient for intra-individual variation) calculations
  - Plotting results
  - Power calculations using MSE or CV

** Cross-sectional Profile
- Visualization and ANOVA
  - AUC, %Change from baseline at time T
  - Multiple correction, overall hypothesis

** Longitudinal Assessment - Correlation Analysis
- Mixed effect repeated measures model
  - Informative Censoring
- Time-varying Biomarker
  - Best for exogenous variable
- Joint modeling of outcome & biomarker over time
- Use AIDS example (CD4 as biomarker) to illustrate all three methods
  - R package "JM"
  - CD4 cell counts has been correlated with time to death from AIDS
- Plots
  - PD biomarker vs Mean percent changes over time
  - Relaction with Clinical Outcome (biomarker percent change at time T vs Hazard Ratio of Onset of Dementia)

