learn_biomarker_analysis.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-01-14 Sun 17:15 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Learn Biomarker Analysis</title>
<meta name="author" content="Yubing Wan" />
<meta name="generator" content="Org Mode" />

</head>
<body>
<div id="content" class="content">
<h1 class="title">Learn Biomarker Analysis</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgc7d1d90">1. What Is A Biomarker</a>
<ul>
<li><a href="#orgd23ad08">1.1. FDA Definition</a>
<ul>
<li><a href="#org77db954">1.1.1. Examples</a></li>
</ul>
</li>
<li><a href="#orge90b6c7">1.2. Fundamental Pharmacology Questions for Biomarkers</a></li>
<li><a href="#orgb0e9c4b">1.3. Evidence Taken Together Integrated Framework for Decision-Making</a></li>
</ul>
</li>
<li><a href="#org6f9a2fb">2. Section I: Pharmacodynamic Biomarkers</a>
<ul>
<li><a href="#orgbbc043a">2.1. Outline</a></li>
<li><a href="#org6dec902">2.2. Objectives of PD Biomarkers</a></li>
<li><a href="#org1df7290">2.3. Toxicology</a></li>
<li><a href="#org96128b8">2.4. Bioequivalence Design</a></li>
<li><a href="#org1cc9fb6">2.5. Cross-sectional Profile</a></li>
<li><a href="#org191a5fc">2.6. Longitudinal Assessment - Correlation Analysis</a></li>
<li><a href="#orgfcc7ccc">2.7. Multiple Biomarkers - Longitudinal Assessment</a></li>
</ul>
</li>
<li><a href="#org928f857">3. Section II: Predictive Biomarkers (Precision Medicine)</a>
<ul>
<li><a href="#orgf02c895">3.1. Outline</a></li>
<li><a href="#org73a95b8">3.2. Objectives of PREDICTIVE Biomarkers</a></li>
<li><a href="#org79a1ed4">3.3. Three Basic Desings for Predictive-Biomarker Enabled Trials</a></li>
<li><a href="#org834e8d6">3.4. Operational Characteristics of Proof of Clinical (POC) Trials with BM+ and BM- Subgroups</a></li>
<li><a href="#org7881bd5">3.5. Operational Characteristics of Confirmatory Trials with BM+ and BM- Subgroups</a></li>
<li><a href="#org239461d">3.6. Cutoff Determination of a Countinuous Predictive Biomarker</a></li>
</ul>
</li>
<li><a href="#orgd96d4cd">4. Section III: Surrogate Biomarkers/Endpoints</a>
<ul>
<li><a href="#orga7bd324">4.1. Objectives of Surrogate Biomarkers</a></li>
<li><a href="#orgb25bc8e">4.2. Strong Correlation of Association between S and T and Captures Full Effect of Treatment on T</a></li>
<li><a href="#orgd8333c2">4.3. Example: Examining the Proportion of Treatment Effect:</a></li>
</ul>
</li>
<li><a href="#org6835549">5. Section IV: Combination Biomarkers</a>
<ul>
<li><a href="#org1a99395">5.1. Objective of Composite Biomarkers</a>
<ul>
<li><a href="#org5eeeda5">5.1.1. What is Machine Learning</a></li>
<li><a href="#org464349c">5.1.2. Goal:</a></li>
<li><a href="#org34527aa">5.1.3. Book:</a></li>
</ul>
</li>
<li><a href="#org19581b4">5.2. Regression Based Models</a></li>
<li><a href="#org498a5eb">5.3. Tree-based method (greedy method)</a></li>
<li><a href="#org8b01372">5.4. Cluster Analysis</a></li>
<li><a href="#orgde2c399">5.5. Network Analysis</a></li>
</ul>
</li>
<li><a href="#orga9cd6d9">6. Section V: Biomarker Statistical Analysis Plan (BSAP)</a>
<ul>
<li><a href="#orgbca7115">6.1. Biomarker Analysis Plan</a></li>
</ul>
</li>
<li><a href="#org728a5dc">7. Misuse and Abuse of Biomarkers</a></li>
<li><a href="#orgff658c2">8. Projects</a>
<ul>
<li><a href="#orgdc69549">8.1. Flow Cytometry</a>
<ul>
<li><a href="#orgb022a64">8.1.1. Understanding Flow Cytometry:</a></li>
<li><a href="#org6c3aef1">8.1.2. Responsibilities and Contributions</a></li>
<li><a href="#org776c381">8.1.3. Statistical Methods for Analyzing Flow Cytometry Data</a></li>
<li><a href="#org233007a">8.1.4. Software for Processing Flow Cytometry Data</a></li>
<li><a href="#orgb5b6a04">8.1.5. Analyzing flow cytometry data with R</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgc7d1d90" class="outline-2">
<h2 id="orgc7d1d90"><span class="section-number-2">1.</span> What Is A Biomarker</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgd23ad08" class="outline-3">
<h3 id="orgd23ad08"><span class="section-number-3">1.1.</span> FDA Definition</h3>
<div class="outline-text-3" id="text-1-1">
<p>
&ldquo;A defined characteristic that is measured as an indicator of normal biological processes, pathogenic processes, or responses to an exposure of intervention, including therapeutic interventions. Molecular, histologic, radiographic, or physiologic characteristics are types of biomarkers. A biomarker is NOT an assessment of how an individual feels, functions, or survives.&rdquo;
</p>
</div>
<div id="outline-container-org77db954" class="outline-4">
<h4 id="org77db954"><span class="section-number-4">1.1.1.</span> Examples</h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
Lab based (LIPIDs), Genetic Biomarker (histologic, blood, fluid, CSF, etc), Radiographic (MRI, PET), composite biomarkers, digital biomarkers.
</p>
</div>
</div>
</div>
<div id="outline-container-orge90b6c7" class="outline-3">
<h3 id="orge90b6c7"><span class="section-number-3">1.2.</span> Fundamental Pharmacology Questions for Biomarkers</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>Drug exposure at target site of action</li>
<li>Binding to pharmacological target (Engagement/Occupancy)</li>
<li>Expression of pharmacology (PD effect)</li>
</ul>
</div>
</div>
<div id="outline-container-orgb0e9c4b" class="outline-3">
<h3 id="orgb0e9c4b"><span class="section-number-3">1.3.</span> Evidence Taken Together Integrated Framework for Decision-Making</h3>
<div class="outline-text-3" id="text-1-3">
<ul class="org-ul">
<li>Several PD biomarkers over several phases of clinical development constitute a complete picture of the drug&rsquo;s mechanism in the body from minutes to hours and days of drug administration
<ul class="org-ul">
<li>Vaidating target engagement</li>
<li>Selection of optimal dose</li>
<li>Identifying potential early efficacy and/or safety</li>
<li>Identification of patient subgroup likely to respond from treatment with the drug</li>
<li>Help design combination therapies</li>
</ul></li>

<li>Pfizer has defined three pillars of survival of a drug through clinical development in order to progress to phase III. The drug condidate must demonstrate:
<ul class="org-ul">
<li>Exposure at the target site of action over a desired period of time</li>
<li>Binding to the pharmacological target as expected for its mode of action</li>
<li>Expression of pharmacological activity commensurate with the demonstrated target exposure and target binding</li>
</ul></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org6f9a2fb" class="outline-2">
<h2 id="org6f9a2fb"><span class="section-number-2">2.</span> Section I: Pharmacodynamic Biomarkers</h2>
<div class="outline-text-2" id="text-2">
<p>
&#x2013; Ecosystem of Tools Predicting Risk and Progression in AD Trials
</p>
</div>
<div id="outline-container-orgbbc043a" class="outline-3">
<h3 id="orgbbc043a"><span class="section-number-3">2.1.</span> Outline</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li>Could range from Proof of Mechanism or Proof of Efficacy</li>
<li>Animal toxicology studies</li>
<li>Bioequivalence Designs</li>
<li>Graphical Visualizations of Biomarker over time</li>
<li>Joint modeling of Biomarker and Efficacy Endpoint
<ul class="org-ul">
<li>Longitudinal model of PD biomarkers by MMRM</li>
<li>Time to Event analysis with time-varying biomarker</li>
<li>Bivariate model of biomarker and endpoint</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org6dec902" class="outline-3">
<h3 id="org6dec902"><span class="section-number-3">2.2.</span> Objectives of PD Biomarkers</h3>
<div class="outline-text-3" id="text-2-2">
<p>
The effort of developing assays and measuring one or more biomarkers across several phases of clinical trials help
</p>

<ul class="org-ul">
<li>Validate target engagement</li>
<li>Select optimal dose</li>
<li>Identify early efficacy/safety</li>
<li>Identify potential subgroup who responds to treatment</li>
<li>Help design combination therapies</li>
<li>&#x2026;</li>
</ul>
</div>
</div>
<div id="outline-container-org1df7290" class="outline-3">
<h3 id="org1df7290"><span class="section-number-3">2.3.</span> Toxicology</h3>
<div class="outline-text-3" id="text-2-3">
<ul class="org-ul">
<li>Rodent in-vivo pre-clinical studies
<ul class="org-ul">
<li>Estimate PK parameters or calculate # of animals in various designs
<ul class="org-ul">
<li>Serial, Complete, Betch Design</li>
</ul></li>
</ul></li>

<li>Non-compartmental PK analysis through R package &ldquo;PK&rdquo;
<ul class="org-ul">
<li>&ldquo;RATS&rdquo; data from holder, et al</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org96128b8" class="outline-3">
<h3 id="org96128b8"><span class="section-number-3">2.4.</span> Bioequivalence Design</h3>
<div class="outline-text-3" id="text-2-4">
<ul class="org-ul">
<li>Corossover equivalence design - tost processedure and composite hypothesis</li>
<li>Composite Hypothesis based on the ratio \(\mu_{T}/\mu_{R}\):
<ul class="org-ul">
<li>H0: \(H_{0}: \mu_{T}/\mu_{R} \le \theta_{1} or \mu_{T}/\mu_{R} \ge \theta_{2} VS \)</li>
</ul></li>
<li>Schultz, et al shows various examples &amp; compares R, SAS and Winnonlin</li>
<li>R package &ldquo;powertost&rdquo; provides power calculations for two one-sided tests</li>
<li>R package &ldquo;BE&rdquo;:
<ul class="org-ul">
<li>Analysis of BE study 2x2x2</li>
<li>MSE calculations; CV (coefficient for intra-individual variation) calculations</li>
<li>Plotting results</li>
<li>Power calculations using MSE or CV</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org1cc9fb6" class="outline-3">
<h3 id="org1cc9fb6"><span class="section-number-3">2.5.</span> Cross-sectional Profile</h3>
<div class="outline-text-3" id="text-2-5">
<ul class="org-ul">
<li>Visualization and ANOVA
<ul class="org-ul">
<li>AUC, %Change from baseline at time T</li>
<li>Multiple correction, overall hypothesis</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org191a5fc" class="outline-3">
<h3 id="org191a5fc"><span class="section-number-3">2.6.</span> Longitudinal Assessment - Correlation Analysis</h3>
<div class="outline-text-3" id="text-2-6">
<ul class="org-ul">
<li>Mixed effect repeated measures model
<ul class="org-ul">
<li>Informative Censoring</li>
</ul></li>
<li>Time-varying Biomarker
<ul class="org-ul">
<li>Best for exogenous variable</li>
</ul></li>
<li>Joint modeling of outcome &amp; biomarker over time</li>
<li>Use AIDS example (CD4 as biomarker) to illustrate all three methods
<ul class="org-ul">
<li>R package &ldquo;JM&rdquo;</li>
<li>CD4 cell counts has been correlated with time to death from AIDS</li>
</ul></li>
<li>Plots
<ul class="org-ul">
<li>PD biomarker vs Mean percent changes over time</li>
<li>Relaction with Clinical Outcome (biomarker percent change at time T vs Hazard Ratio of Onset of Dementia)</li>
</ul></li>
</ul>
</div>
</div>
