learn_biomarker_analysis.org
** Multiple Biomarkers - Longitudinal Assessment
- Objective: Look at relationships with clinical outcome and inter-relationships
- Forest Plots
- Network Analysis - Gaussion Graphical Models
- Heatmaps - well used methodology

* Section II: Predictive Biomarkers (Precision Medicine)
- Patient stratification

** Outline
- Identify subset of patients based on a biomarker - who responds to therapy
- Uncentainty remains on who is biomarker positive vs negative
- Identify cutpoint to split subjects into positive vs negative
  - Sample size calculations for POC and conformatory trials
- Seamless trial with stage I - assess treatment group in pos vs negative; stage II - confirm effect on positive and/or overall population

** Objectives of PREDICTIVE Biomarkers
Predictive biomarkers are about identifying patients who will respond to treatment
- May be different from a prognostic biomarker
- May need drug-diagnostic co-development
- Identify early efficacy/safety
- Identify potential subgroup who responds to treatment
- Help design combination therapies

** Three Basic Desings for Predictive-Biomarker Enabled Trials
- Biomarker Identified Subgroup
  - Test biomarker, only include biomarker positve patients -> randomize to treatment and control
- Biomarker Stratified Design
  - Test Biomarker, randomize both postive and negative separately for treatment and control
- Biomarker Adaptive Desing
  - Test Biomarker, try stage I on both positive and negative patients, successful group go to stage II.

** Operational Characteristics of Proof of Clinical (POC) Trials with BM+ and BM- Subgroups
- R package "RPACT" is used nad code given to calculate rectuitment and study duration for a given sample size
  - O.C. for BM+ group
  - O.C. for overall population
- Power curves for above for survival endpoint - Power via parametric Dunnett procedure
- Multiple endpoint correction

** Operational Characteristics of Confirmatory Trials with BM+ and BM- Subgroups
- R code for different closed testing procedures
  - Fixed, Bonferroni, Hochberg, Dunnett
  - Example developed from oncology with data and code for extracting correct p-values
    - Power calculations (for both BM+ and Overall) - Code and Mechanism

** Cutoff Determination of a Countinuous Predictive Biomarker
- Let us model the biomarker effect when disease outcome is continous
  - E(Y| Trt, BM) = beta0 + betaTrt Trt + betaBM BM + beta1X Trt x BM
    - When ... : The marker is neither predictive or prognostic
    - When ... : The marker is prognostic, but not predictive
    - When ... : The marker is predictive, but not prognostic
    - When ... : The marker is both predictive and prognostic

- Methods: Median, Quartile Splits; Optimal Split; STEPP
  - Good Summary: Haller 2019
- Methods: Morrison and Simon (2016) Rank conditional coverage and CI in high-dimensional problems
  - Holmgren (2017) Group Sequential Method for Cutpoint Selection
- Methods: Bootstrap, Bayesian Hierarchical Models ("BHM")
- Adaptive Threshold Design
- Adaptive Seamless Design
  - R Package "ASD" [Jenkins]
- Method: Rank Conditional Coverage and CI in High-dimension
  - RCC is the expeted coverage rate of an interval given the rank of the parameter; uses bootstrapping to produce small intervals
  - "RCC" package
- Method: Group Sequential Method
  - Group sequential stopping boundaries that provide strong control of Type I error of testing a series of hypothesis over a range of marker expression values
- Let \lambda1, \lambda2, \lambda3, and \lambda4 be the Hazard Ratios of a time to event

* Section III: Surrogate Biomarkers/Endpoints
 -- Correlated with Treatment Effect on Clinical Endpoint

** Objectives of Surrogate Biomarkers
NIH (USA) defines surrogate endpoint as "A biomarker intended to substitute for a clinical endpoint"

**Surrogate Endpoints** are used instead of cinical outcomes in some clinical trials. Surrogate endpoints are used when the clinical outcomes might take a very long time to study, or in cases where the clinical benefit of improving the surrogate endpoint, such as controlling blood preasure, is well understood. Clinical trials are needed to show what surrogate endpoints can be relied upon to predict, or correlated with clinical benefit. Surrogate endpoints that have undergone this setting are called vaidated surrogate endpoints and these are accepted by the FDA as evidence of benefit.

Between 2010 and 2012, the FDA approved 45% of new drugs on the basis of a surrogate endpoint.

- Regulatory hurdle for getting a biomarker approved as a surrogate
- Surrogate could save time in trials if observed earlier than clinical endpoint
- Outline
  - Definition of surrogate biomarkers
  - Meta-analysis framework
  - Within-trial framework
  - Proportion of treatment effect explained (PTE)

The FDA (R) categorizeds surrogate endpoints in roughly three hierarchical categories:
- Candidate surrogate endpoint
- Reasonably likely surrogate endpoint (Approval is conditional)
- Validated surrogate endpoint (Approval is regular)

Few examples:
- Time to Progression (TTP)
- Progression Free Survival (PFS)
- Response Rate (RR)

A. Disease -> Intervention -> Surrogate endpoint -> True clinical output
B. Disease -> Surrogate endpoint
           -> True clinical output
C. ...

** Strong Correlation of Association between S and T and Captures Full Effect of Treatment on T

Prentice Criteria
Normal Dist Endpoint

Quantify surrogate between endpoints has two requirements:
- Requirement #1: Trial Level - Assess the ability of the treatment effect of the surrogate endpoint to predict the true endpoint (\(R^2_{trial}\))
- Requirement #2: Individual Level - Assess the correlation between the surrogate and true endpoints after adjusting for treatment (\(R^2_{indiv}\))
  - Copula Model Implementation via R package "surrosurv" for the endpoints

