learn_biomarker_analysis.html
<div id="outline-container-orgfcc7ccc" class="outline-3">
<h3 id="orgfcc7ccc"><span class="section-number-3">2.7.</span> Multiple Biomarkers - Longitudinal Assessment</h3>
<div class="outline-text-3" id="text-2-7">
<ul class="org-ul">
<li>Objective: Look at relationships with clinical outcome and inter-relationships</li>
<li>Forest Plots</li>
<li>Network Analysis - Gaussion Graphical Models</li>
<li>Heatmaps - well used methodology</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org928f857" class="outline-2">
<h2 id="org928f857"><span class="section-number-2">3.</span> Section II: Predictive Biomarkers (Precision Medicine)</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>Patient stratification</li>
</ul>
</div>
<div id="outline-container-orgf02c895" class="outline-3">
<h3 id="orgf02c895"><span class="section-number-3">3.1.</span> Outline</h3>
<div class="outline-text-3" id="text-3-1">
<ul class="org-ul">
<li>Identify subset of patients based on a biomarker - who responds to therapy</li>
<li>Uncentainty remains on who is biomarker positive vs negative</li>
<li>Identify cutpoint to split subjects into positive vs negative
<ul class="org-ul">
<li>Sample size calculations for POC and conformatory trials</li>
</ul></li>
<li>Seamless trial with stage I - assess treatment group in pos vs negative; stage II - confirm effect on positive and/or overall population</li>
</ul>
</div>
</div>
<div id="outline-container-org73a95b8" class="outline-3">
<h3 id="org73a95b8"><span class="section-number-3">3.2.</span> Objectives of PREDICTIVE Biomarkers</h3>
<div class="outline-text-3" id="text-3-2">
<p>
Predictive biomarkers are about identifying patients who will respond to treatment
</p>
<ul class="org-ul">
<li>May be different from a prognostic biomarker</li>
<li>May need drug-diagnostic co-development</li>
<li>Identify early efficacy/safety</li>
<li>Identify potential subgroup who responds to treatment</li>
<li>Help design combination therapies</li>
</ul>
</div>
</div>
<div id="outline-container-org79a1ed4" class="outline-3">
<h3 id="org79a1ed4"><span class="section-number-3">3.3.</span> Three Basic Desings for Predictive-Biomarker Enabled Trials</h3>
<div class="outline-text-3" id="text-3-3">
<ul class="org-ul">
<li>Biomarker Identified Subgroup
<ul class="org-ul">
<li>Test biomarker, only include biomarker positve patients -&gt; randomize to treatment and control</li>
</ul></li>
<li>Biomarker Stratified Design
<ul class="org-ul">
<li>Test Biomarker, randomize both postive and negative separately for treatment and control</li>
</ul></li>
<li>Biomarker Adaptive Desing
<ul class="org-ul">
<li>Test Biomarker, try stage I on both positive and negative patients, successful group go to stage II.</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org834e8d6" class="outline-3">
<h3 id="org834e8d6"><span class="section-number-3">3.4.</span> Operational Characteristics of Proof of Clinical (POC) Trials with BM+ and BM- Subgroups</h3>
<div class="outline-text-3" id="text-3-4">
<ul class="org-ul">
<li>R package &ldquo;RPACT&rdquo; is used nad code given to calculate rectuitment and study duration for a given sample size
<ul class="org-ul">
<li>O.C. for BM+ group</li>
<li>O.C. for overall population</li>
</ul></li>
<li>Power curves for above for survival endpoint - Power via parametric Dunnett procedure</li>
<li>Multiple endpoint correction</li>
</ul>
</div>
</div>
<div id="outline-container-org7881bd5" class="outline-3">
<h3 id="org7881bd5"><span class="section-number-3">3.5.</span> Operational Characteristics of Confirmatory Trials with BM+ and BM- Subgroups</h3>
<div class="outline-text-3" id="text-3-5">
<ul class="org-ul">
<li>R code for different closed testing procedures
<ul class="org-ul">
<li>Fixed, Bonferroni, Hochberg, Dunnett</li>
<li>Example developed from oncology with data and code for extracting correct p-values
<ul class="org-ul">
<li>Power calculations (for both BM+ and Overall) - Code and Mechanism</li>
</ul></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org239461d" class="outline-3">
<h3 id="org239461d"><span class="section-number-3">3.6.</span> Cutoff Determination of a Countinuous Predictive Biomarker</h3>
<div class="outline-text-3" id="text-3-6">
<ul class="org-ul">
<li>Let us model the biomarker effect when disease outcome is continous
<ul class="org-ul">
<li>E(Y| Trt, BM) = beta0 + betaTrt Trt + betaBM BM + beta1X Trt x BM
<ul class="org-ul">
<li>When &#x2026; : The marker is neither predictive or prognostic</li>
<li>When &#x2026; : The marker is prognostic, but not predictive</li>
<li>When &#x2026; : The marker is predictive, but not prognostic</li>
<li>When &#x2026; : The marker is both predictive and prognostic</li>
</ul></li>
</ul></li>

<li>Methods: Median, Quartile Splits; Optimal Split; STEPP
<ul class="org-ul">
<li>Good Summary: Haller 2019</li>
</ul></li>
<li>Methods: Morrison and Simon (2016) Rank conditional coverage and CI in high-dimensional problems
<ul class="org-ul">
<li>Holmgren (2017) Group Sequential Method for Cutpoint Selection</li>
</ul></li>
<li>Methods: Bootstrap, Bayesian Hierarchical Models (&ldquo;BHM&rdquo;)</li>
<li>Adaptive Threshold Design</li>
<li>Adaptive Seamless Design
<ul class="org-ul">
<li>R Package &ldquo;ASD&rdquo; [Jenkins]</li>
</ul></li>
<li>Method: Rank Conditional Coverage and CI in High-dimension
<ul class="org-ul">
<li>RCC is the expeted coverage rate of an interval given the rank of the parameter; uses bootstrapping to produce small intervals</li>
<li>&ldquo;RCC&rdquo; package</li>
</ul></li>
<li>Method: Group Sequential Method
<ul class="org-ul">
<li>Group sequential stopping boundaries that provide strong control of Type I error of testing a series of hypothesis over a range of marker expression values</li>
</ul></li>
<li>Let &lambda;1, &lambda;2, &lambda;3, and &lambda;4 be the Hazard Ratios of a time to event</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgd96d4cd" class="outline-2">
<h2 id="orgd96d4cd"><span class="section-number-2">4.</span> Section III: Surrogate Biomarkers/Endpoints</h2>
<div class="outline-text-2" id="text-4">
<p>
&#x2013; Correlated with Treatment Effect on Clinical Endpoint
</p>
</div>
<div id="outline-container-orga7bd324" class="outline-3">
<h3 id="orga7bd324"><span class="section-number-3">4.1.</span> Objectives of Surrogate Biomarkers</h3>
<div class="outline-text-3" id="text-4-1">
<p>
NIH (USA) defines surrogate endpoint as &ldquo;A biomarker intended to substitute for a clinical endpoint&rdquo;
</p>

<p>
<b><b>Surrogate Endpoints</b></b> are used instead of cinical outcomes in some clinical trials. Surrogate endpoints are used when the clinical outcomes might take a very long time to study, or in cases where the clinical benefit of improving the surrogate endpoint, such as controlling blood preasure, is well understood. Clinical trials are needed to show what surrogate endpoints can be relied upon to predict, or correlated with clinical benefit. Surrogate endpoints that have undergone this setting are called vaidated surrogate endpoints and these are accepted by the FDA as evidence of benefit.
</p>

<p>
Between 2010 and 2012, the FDA approved 45% of new drugs on the basis of a surrogate endpoint.
</p>

<ul class="org-ul">
<li>Regulatory hurdle for getting a biomarker approved as a surrogate</li>
<li>Surrogate could save time in trials if observed earlier than clinical endpoint</li>
<li>Outline
<ul class="org-ul">
<li>Definition of surrogate biomarkers</li>
<li>Meta-analysis framework</li>
<li>Within-trial framework</li>
<li>Proportion of treatment effect explained (PTE)</li>
</ul></li>
</ul>

<p>
The FDA (R) categorizeds surrogate endpoints in roughly three hierarchical categories:
</p>
<ul class="org-ul">
<li>Candidate surrogate endpoint</li>
<li>Reasonably likely surrogate endpoint (Approval is conditional)</li>
<li>Validated surrogate endpoint (Approval is regular)</li>
</ul>

<p>
Few examples:
</p>
<ul class="org-ul">
<li>Time to Progression (TTP)</li>
<li>Progression Free Survival (PFS)</li>
<li>Response Rate (RR)</li>

<li>Disease -&gt; Intervention -&gt; Surrogate endpoint -&gt; True clinical output</li>
<li>Disease -&gt; Surrogate endpoint
-&gt; True clinical output</li>
<li>&#x2026;</li>
</ul>
</div>
</div>
<div id="outline-container-orgb25bc8e" class="outline-3">
<h3 id="orgb25bc8e"><span class="section-number-3">4.2.</span> Strong Correlation of Association between S and T and Captures Full Effect of Treatment on T</h3>
<div class="outline-text-3" id="text-4-2">
<p>
Prentice Criteria
Normal Dist Endpoint
</p>

<p>
Quantify surrogate between endpoints has two requirements:
</p>
<ul class="org-ul">
<li>Requirement #1: Trial Level - Assess the ability of the treatment effect of the surrogate endpoint to predict the true endpoint (\(R^2_{trial}\))</li>
<li>Requirement #2: Individual Level - Assess the correlation between the surrogate and true endpoints after adjusting for treatment (\(R^2_{indiv}\))
<ul class="org-ul">
<li>Copula Model Implementation via R package &ldquo;surrosurv&rdquo; for the endpoints</li>
</ul></li>
</ul>
</div>
</div>
