learn_biomarker_analysis.html
<div id="outline-container-orgd8333c2" class="outline-3">
<h3 id="orgd8333c2"><span class="section-number-3">4.3.</span> Example: Examining the Proportion of Treatment Effect:</h3>
<div class="outline-text-3" id="text-4-3">
<ul class="org-ul">
<li>Hughes (*) shows the two methods for determining PTE on AIDS clinical trials
<ul class="org-ul">
<li>T = Progression to AIDS or Death after 6 Months</li>
<li>S = Change in CD4 cell count</li>
<li>R code given based on Zamboni PhD dissertation to create bivariate distribution of data with and without surrogate endpoint as a predictor. Data used is AIDS data set released with Hughes seminal paper
<ul class="org-ul">
<li>Produce PTE and CI for each trial; and overall</li>
</ul></li>
</ul></li>
<li>Bayesian Linear Regression
<ul class="org-ul">
<li>R code given on same data set</li>
</ul></li>
<li>CD4 count is surrogate for HR (Bayesian estimate how slope excludes 0; but intercpt does not)</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org6835549" class="outline-2">
<h2 id="org6835549"><span class="section-number-2">5.</span> Section IV: Combination Biomarkers</h2>
<div class="outline-text-2" id="text-5">
<p>
&#x2013; Combination Biomarkers into a Predictve Model via Machine Learning
</p>
</div>
<div id="outline-container-org1a99395" class="outline-3">
<h3 id="org1a99395"><span class="section-number-3">5.1.</span> Objective of Composite Biomarkers</h3>
<div class="outline-text-3" id="text-5-1">
</div>
<div id="outline-container-org5eeeda5" class="outline-4">
<h4 id="org5eeeda5"><span class="section-number-4">5.1.1.</span> What is Machine Learning</h4>
<div class="outline-text-4" id="text-5-1-1">
<p>
&ldquo;Machine Learning: Field of study that gives computers the ability to learn without being explicitly programmed&rdquo; - Arthur Samuel (1959)
</p>
</div>
</div>
<div id="outline-container-org464349c" class="outline-4">
<h4 id="org464349c"><span class="section-number-4">5.1.2.</span> Goal:</h4>
<div class="outline-text-4" id="text-5-1-2">
<p>
Build predictive signatures of a clinical event or outcome or disease status
</p>
</div>
</div>
<div id="outline-container-org34527aa" class="outline-4">
<h4 id="org34527aa"><span class="section-number-4">5.1.3.</span> Book:</h4>
<div class="outline-text-4" id="text-5-1-3">
<ul class="org-ul">
<li>Regularized Machine Learning Models for
<ul class="org-ul">
<li>(A) Variable Selection</li>
<li>(B) Predictive Signature Development
<ul class="org-ul">
<li>Diagnostic / Prognostic / Treatment Responder / Safety Risk</li>
</ul></li>
</ul></li>
<li>Unsupervised Learning Models for
<ul class="org-ul">
<li>Finding clusters of biomarkers related to disease heterogeneity or in treatment group as a measure of group-wide covariation</li>
</ul></li>
<li>Graphical Methods for
<ul class="org-ul">
<li>Exploring Interrelationship between biomarkers</li>
</ul></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org19581b4" class="outline-3">
<h3 id="org19581b4"><span class="section-number-3">5.2.</span> Regression Based Models</h3>
<div class="outline-text-3" id="text-5-2">
<ul class="org-ul">
<li>Variable selection
<ul class="org-ul">
<li>Best subset selection - backward / forward</li>
<li>Cross Validation</li>
<li>Best GLM</li>
<li>Family-wise error rate - correction</li>
<li>One as the rule - size of</li>
</ul></li>
<li>Regularization
<ul class="org-ul">
<li>Determine Values of Tuning Parameters
<ul class="org-ul">
<li>Ridge / Lasso / Elastic Net / SPLS</li>
</ul></li>
</ul></li>
<li>Regularization for Interaction between Treatment and Biomarker</li>
<li>R package &ldquo;caret&rdquo;</li>
<li>Hierarchical Group Lasso</li>
</ul>
</div>
</div>
<div id="outline-container-org498a5eb" class="outline-3">
<h3 id="org498a5eb"><span class="section-number-3">5.3.</span> Tree-based method (greedy method)</h3>
<div class="outline-text-3" id="text-5-3">
<ul class="org-ul">
<li>Non-parametric Procedures
<ul class="org-ul">
<li>Prevent overfitting by minimal cost-complexity pruning
<ul class="org-ul">
<li>R package &ldquo;rpart&rdquo;</li>
</ul></li>
</ul></li>
<li>Classification Trees / Survival Trees / Random Forest</li>
</ul>
</div>
</div>
<div id="outline-container-org8b01372" class="outline-3">
<h3 id="org8b01372"><span class="section-number-3">5.4.</span> Cluster Analysis</h3>
<div class="outline-text-3" id="text-5-4">
<ul class="org-ul">
<li>PAM clustering</li>
<li>Hierarchical Clustering</li>
<li>Tutorial ()</li>
</ul>
</div>
</div>
<div id="outline-container-orgde2c399" class="outline-3">
<h3 id="orgde2c399"><span class="section-number-3">5.5.</span> Network Analysis</h3>
<div class="outline-text-3" id="text-5-5">
<ul class="org-ul">
<li>Detect association between variables in out graphical models (causal or not) after adjusting for all other variables.</li>
<li>Estimating the inter-connectedness between variables and regularizing the network topology in order to detect significant associations remain underutilized in biomarker research.</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orga9cd6d9" class="outline-2">
<h2 id="orga9cd6d9"><span class="section-number-2">6.</span> Section V: Biomarker Statistical Analysis Plan (BSAP)</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-orgbca7115" class="outline-3">
<h3 id="orgbca7115"><span class="section-number-3">6.1.</span> Biomarker Analysis Plan</h3>
<div class="outline-text-3" id="text-6-1">
<ul class="org-ul">
<li>Developed together with translational science team
<ul class="org-ul">
<li>Scintific rationale for each biomarker to be included</li>
</ul></li>
<li>Minimal overlap with Study Protocol and SAP</li>
<li>Main predictive biomarker may be covered in SAP
<ul class="org-ul">
<li>Supplemental analyses in BSAP</li>
</ul></li>
<li>Seven (7) sections outlined</li>
<li>General Consideration
<ul class="org-ul">
<li>missing value</li>
</ul></li>
<li>Statistical Methods</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org728a5dc" class="outline-2">
<h2 id="org728a5dc"><span class="section-number-2">7.</span> Misuse and Abuse of Biomarkers</h2>
<div class="outline-text-2" id="text-7">
<ul class="org-ul">
<li>Incomplete use
<ul class="org-ul">
<li>Totality of evidence not considered from clinical trial biomarker data</li>
<li>Need systematic plan for analysis between rationale for inclusion</li>
</ul></li>
<li>Wrong Use
<ul class="org-ul">
<li>Target engagement, dose selection or efficacy</li>
</ul></li>
<li>Lack of Use
<ul class="org-ul">
<li>Not embracing predictive group or ignoring precision medicine approach</li>
</ul></li>
<li>Not embracing new modalities of biomarkers
<ul class="org-ul">
<li>Imaging, digital biomarkers</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgff658c2" class="outline-2">
<h2 id="orgff658c2"><span class="section-number-2">8.</span> Projects</h2>
<div class="outline-text-2" id="text-8">
</div>
<div id="outline-container-orgdc69549" class="outline-3">
<h3 id="orgdc69549"><span class="section-number-3">8.1.</span> Flow Cytometry</h3>
<div class="outline-text-3" id="text-8-1">
</div>
<div id="outline-container-orgb022a64" class="outline-4">
<h4 id="orgb022a64"><span class="section-number-4">8.1.1.</span> Understanding Flow Cytometry:</h4>
<div class="outline-text-4" id="text-8-1-1">
<ul class="org-ul">
<li>Cell Characterization: Flow cytometry can differentiate cells based on size, granularity, and fluorescence intensity. This is achieved by labeling cells with fluorescent markers that bind to specific cell components or proteins.</li>
<li>Quantification: It quantifies how many cells express a particular marker (cell count) and the proportion of these cells relative to the total cell population (percentage).</li>
</ul>
</div>
<ol class="org-ol">
<li><a id="org9a72fd9"></a>Using Cell Counts and Percentages as Biomarkers:<br />
<div class="outline-text-5" id="text-8-1-1-1">
<ol class="org-ol">
<li>Disease Diagnosis and Monitoring:
<ul class="org-ul">
<li>Cancer: For example, in leukemia and lymphoma, abnormal levels or proportions of certain white blood cells can be indicative of disease.</li>
<li>Immunological Disorders: Changes in the percentages of T-cell subsets (like CD4+ and CD8+ cells) can indicate immunological disorders, including HIV/AIDS.</li>
</ul></li>

<li>Therapeutic Monitoring:
<ul class="org-ul">
<li>Response to Treatment: In cancer therapy, changes in tumor cell populations or immune cells can indicate the effectiveness of treatment.</li>
<li>Autoimmune Diseases: Monitoring specific immune cells can help in assessing the response to treatments in conditions like rheumatoid arthritis or multiple sclerosis.</li>
</ul></li>

<li>Transplantation Medicine:
<ul class="org-ul">
<li>Graft vs. Host Disease (GvHD): Post bone marrow transplant, the proportions of donor vs. recipient cells can be critical in monitoring GvHD or transplant rejection.</li>
</ul></li>

<li>Research and Drug Development:
<ul class="org-ul">
<li>Pharmacodynamics: Assessing how a drug affects specific cell populations.</li>
<li>Biomarker Discovery: Identifying new biomarkers for diseases based on unique cell population characteristics.</li>
</ul></li>

<li>Personalized Medicine:
<ul class="org-ul">
<li>Tailoring Therapies: Flow cytometry data can guide personalized treatment plans, especially in oncology, by understanding individual patient’s tumor and immune cell characteristics.</li>
</ul></li>
</ol>
</div>
</li>
<li><a id="org1366022"></a>Advantages:<br />
<div class="outline-text-5" id="text-8-1-1-2">
<ul class="org-ul">
<li>Highly Specific: Can target specific cell types or even subtypes.</li>
<li>Quantitative and Qualitative Data: Provides both numerical data and information on cell characteristics.</li>
<li>Rapid and Sensitive: Can process and analyze millions of cells quickly.</li>
</ul>
</div>
</li>
